## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.locust is tainted, so must be replaced
-/+ resource "argocd_application" "locust" {
!       id      = "locust" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "locust"
!           resource_version = "2947218" -> (known after apply)
!           uid              = "3a3992d8-7b76-4f48-9340-ec1a90c30de3" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace.locust will be created
+   resource "kubernetes_namespace" "locust" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 635.76 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 635.76 | 635.76|
| | **Total** | **0.00** | **635.76** | **635.76** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
